chaunm/uMQTT-LPC54608/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_DIGITAL_EN 0x0100u    /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u           /*!<@brief Selects pin function 0 */
#define IOCON_PIO_FUNC1 0x01u           /*!<@brief Selects pin function 1 */
#define IOCON_PIO_FUNC6 0x06u           /*!<@brief Selects pin function 6 */
#define IOCON_PIO_I2CDRIVE_HIGH 0x0400u /*!<@brief High drive: 20 mA */
#define IOCON_PIO_I2CFILTER_EN 0x00u    /*!<@brief I2C 50 ns glitch filter enabled */
#define IOCON_PIO_I2CSLEW_I2C 0x00u     /*!<@brief I2C mode */
#define IOCON_PIO_INPFILT_OFF 0x0200u   /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u          /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u      /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u     /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u    /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_FAST 0x0400u     /*!<@brief Fast mode, slew rate control is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u   /*!<@brief Standard mode, output slew rate control is enabled */
#define PIO017_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO017_FUNC_ALT7 0x07u          /*!<@brief Selects pin function.: Alternative connection 7. */
#define PIO226_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO226_FUNC_ALT0 0x00u          /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO410_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO410_FUNC_ALT1 0x01u          /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO411_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO411_FUNC_ALT1 0x01u          /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO412_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO412_FUNC_ALT1 0x01u          /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO413_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO413_FUNC_ALT1 0x01u          /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO414_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO414_FUNC_ALT1 0x01u          /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO415_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO415_FUNC_ALT1 0x01u          /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO416_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO416_FUNC_ALT1 0x01u          /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO48_DIGIMODE_DIGITAL 0x01u    /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO48_FUNC_ALT1 0x01u           /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name FC0_TXD_SCL_MISO (coord A2), U24[12]/P0_30-ISP_FC0_TXD
  @{ */
#define BOARD_INITPINS_ISP_FC0_TXD_PERIPHERAL FLEXCOMM0              /*!<@brief Device name: FLEXCOMM0 */
#define BOARD_INITPINS_ISP_FC0_TXD_SIGNAL TXD_SCL_MISO               /*!<@brief FLEXCOMM0 signal: TXD_SCL_MISO */
#define BOARD_INITPINS_ISP_FC0_TXD_PIN_NAME FC0_TXD_SCL_MISO         /*!<@brief Pin name */
#define BOARD_INITPINS_ISP_FC0_TXD_LABEL "U24[12]/P0_30-ISP_FC0_TXD" /*!<@brief Label */
#define BOARD_INITPINS_ISP_FC0_TXD_NAME "ISP_FC0_TXD"                /*!<@brief Identifier name */
                                                                     /* @} */

/*! @name FC0_RXD_SDA_MOSI (coord B13), U24[13]/P0_29-ISP_FC0_RXD
  @{ */
#define BOARD_INITPINS_ISP_FC0_RXD_PERIPHERAL FLEXCOMM0              /*!<@brief Device name: FLEXCOMM0 */
#define BOARD_INITPINS_ISP_FC0_RXD_SIGNAL RXD_SDA_MOSI               /*!<@brief FLEXCOMM0 signal: RXD_SDA_MOSI */
#define BOARD_INITPINS_ISP_FC0_RXD_PIN_NAME FC0_RXD_SDA_MOSI         /*!<@brief Pin name */
#define BOARD_INITPINS_ISP_FC0_RXD_LABEL "U24[13]/P0_29-ISP_FC0_RXD" /*!<@brief Label */
#define BOARD_INITPINS_ISP_FC0_RXD_NAME "ISP_FC0_RXD"                /*!<@brief Identifier name */
                                                                     /* @} */

/*! @name EMC_D(0) (coord E9), U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0
  @{ */
/*!
 * @brief Device name: EMC */
#define BOARD_INITPINS_EMC_D0_PERIPHERAL EMC
/*!
 * @brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D0_SIGNAL EMC_D
/*!
 * @brief EMC EMC_D channel: 0 */
#define BOARD_INITPINS_EMC_D0_CHANNEL 0
/*!
 * @brief Pin name */
#define BOARD_INITPINS_EMC_D0_PIN_NAME EMC_D(0)
/*!
 * @brief Label */
#define BOARD_INITPINS_EMC_D0_LABEL "U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_EMC_D0_NAME "EMC_D0"
/* @} */

/*! @name EMC_D(1) (coord A10), U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1
  @{ */
/*!
 * @brief Device name: EMC */
#define BOARD_INITPINS_EMC_D1_PERIPHERAL EMC
/*!
 * @brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D1_SIGNAL EMC_D
/*!
 * @brief EMC EMC_D channel: 1 */
#define BOARD_INITPINS_EMC_D1_CHANNEL 1
/*!
 * @brief Pin name */
#define BOARD_INITPINS_EMC_D1_PIN_NAME EMC_D(1)
/*!
 * @brief Label */
#define BOARD_INITPINS_EMC_D1_LABEL "U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_EMC_D1_NAME "EMC_D1"
/* @} */

/*! @name EMC_D(2) (coord C8), U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2
  @{ */
/*!
 * @brief Device name: EMC */
#define BOARD_INITPINS_EMC_D2_PERIPHERAL EMC
/*!
 * @brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D2_SIGNAL EMC_D
/*!
 * @brief EMC EMC_D channel: 2 */
#define BOARD_INITPINS_EMC_D2_CHANNEL 2
/*!
 * @brief Pin name */
#define BOARD_INITPINS_EMC_D2_PIN_NAME EMC_D(2)
/*!
 * @brief Label */
#define BOARD_INITPINS_EMC_D2_LABEL "U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_EMC_D2_NAME "EMC_D2"
/* @} */

/*! @name EMC_D(3) (coord E7), U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3
  @{ */
/*!
 * @brief Device name: EMC */
#define BOARD_INITPINS_EMC_D3_PERIPHERAL EMC
/*!
 * @brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D3_SIGNAL EMC_D
/*!
 * @brief EMC EMC_D channel: 3 */
#define BOARD_INITPINS_EMC_D3_CHANNEL 3
/*!
 * @brief Pin name */
#define BOARD_INITPINS_EMC_D3_PIN_NAME EMC_D(3)
/*!
 * @brief Label */
#define BOARD_INITPINS_EMC_D3_LABEL "U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_EMC_D3_NAME "EMC_D3"
/* @} */

/*! @name EMC_D(4) (coord A5), U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4
  @{ */
/*!
 * @brief Device name: EMC */
#define BOARD_INITPINS_EMC_D4_PERIPHERAL EMC
/*!
 * @brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D4_SIGNAL EMC_D
/*!
 * @brief EMC EMC_D channel: 4 */
#define BOARD_INITPINS_EMC_D4_CHANNEL 4
/*!
 * @brief Pin name */
#define BOARD_INITPINS_EMC_D4_PIN_NAME EMC_D(4)
/*!
 * @brief Label */
#define BOARD_INITPINS_EMC_D4_LABEL "U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_EMC_D4_NAME "EMC_D4"
/* @} */

/*! @name EMC_D(5) (coord H12), U28[D9]/RP5[3]/P0_7-EMC_D5
  @{ */
#define BOARD_INITPINS_EMC_D5_PERIPHERAL EMC                     /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D5_SIGNAL EMC_D                       /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D5_CHANNEL 5                          /*!<@brief EMC EMC_D channel: 5 */
#define BOARD_INITPINS_EMC_D5_PIN_NAME EMC_D(5)                  /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D5_LABEL "U28[D9]/RP5[3]/P0_7-EMC_D5" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D5_NAME "EMC_D5"                      /*!<@brief Identifier name */
                                                                 /* @} */

