chaunm/uMQTT-LPC54608/board/pin_mux.h
/*! @name EMC_D(6) (coord H10), U28[D8]/RP5[2]/P0_8-EMC_D6
  @{ */
#define BOARD_INITPINS_EMC_D6_PERIPHERAL EMC                     /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D6_SIGNAL EMC_D                       /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D6_CHANNEL 6                          /*!<@brief EMC EMC_D channel: 6 */
#define BOARD_INITPINS_EMC_D6_PIN_NAME EMC_D(6)                  /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D6_LABEL "U28[D8]/RP5[2]/P0_8-EMC_D6" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D6_NAME "EMC_D6"                      /*!<@brief Identifier name */
                                                                 /* @} */

/*! @name EMC_D(7) (coord G12), U28[E9]/RP5[1]/P0_9-EMC_D7
  @{ */
#define BOARD_INITPINS_EMC_D7_PERIPHERAL EMC                     /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D7_SIGNAL EMC_D                       /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D7_CHANNEL 7                          /*!<@brief EMC EMC_D channel: 7 */
#define BOARD_INITPINS_EMC_D7_PIN_NAME EMC_D(7)                  /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D7_LABEL "U28[E9]/RP5[1]/P0_9-EMC_D7" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D7_NAME "EMC_D7"                      /*!<@brief Identifier name */
                                                                 /* @} */

/*! @name EMC_WEN (coord L4), U28[F9]/P0_15-EMC_WEn
  @{ */
#define BOARD_INITPINS_EMC_WEn_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_WEn_SIGNAL EMC_WE                 /*!<@brief EMC signal: EMC_WE */
#define BOARD_INITPINS_EMC_WEn_PIN_NAME EMC_WEN              /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_WEn_LABEL "U28[F9]/P0_15-EMC_WEn" /*!<@brief Label */
#define BOARD_INITPINS_EMC_WEn_NAME "EMC_WEn"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_A(0) (coord C14), U28[H7]/P0_18-EMC_A0
  @{ */
#define BOARD_INITPINS_EMC_A0_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A0_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A0_CHANNEL 0                    /*!<@brief EMC EMC_A channel: 0 */
#define BOARD_INITPINS_EMC_A0_PIN_NAME EMC_A(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A0_LABEL "U28[H7]/P0_18-EMC_A0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A0_NAME "EMC_A0"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_A(1) (coord C6), U28[H8]/P0_19-EMC_A1
  @{ */
#define BOARD_INITPINS_EMC_A1_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A1_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A1_CHANNEL 1                    /*!<@brief EMC EMC_A channel: 1 */
#define BOARD_INITPINS_EMC_A1_PIN_NAME EMC_A(1)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A1_LABEL "U28[H8]/P0_19-EMC_A1" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A1_NAME "EMC_A1"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_A(2) (coord D13), U28[J8]/P0_20-EMC_A2
  @{ */
#define BOARD_INITPINS_EMC_A2_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A2_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A2_CHANNEL 2                    /*!<@brief EMC EMC_A channel: 2 */
#define BOARD_INITPINS_EMC_A2_PIN_NAME EMC_A(2)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A2_LABEL "U28[J8]/P0_20-EMC_A2" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A2_NAME "EMC_A2"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_A(3) (coord C13), U28[J7]/P0_21-EMC_A3
  @{ */
#define BOARD_INITPINS_EMC_A3_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A3_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A3_CHANNEL 3                    /*!<@brief EMC EMC_A channel: 3 */
#define BOARD_INITPINS_EMC_A3_PIN_NAME EMC_A(3)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A3_LABEL "U28[J7]/P0_21-EMC_A3" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A3_NAME "EMC_A3"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_D(11) (coord D4), U28[C2]/RP4[1]/P1_4-EMC_D11
  @{ */
#define BOARD_INITPINS_EMC_D11_PERIPHERAL EMC                      /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D11_SIGNAL EMC_D                        /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D11_CHANNEL 11                          /*!<@brief EMC EMC_D channel: 11 */
#define BOARD_INITPINS_EMC_D11_PIN_NAME EMC_D(11)                  /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D11_LABEL "U28[C2]/RP4[1]/P1_4-EMC_D11" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D11_NAME "EMC_D11"                      /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name EMC_A(4) (coord E4), U28[J3]/P1_5-EMC_A4
  @{ */
#define BOARD_INITPINS_EMC_A4_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A4_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A4_CHANNEL 4                   /*!<@brief EMC EMC_A channel: 4 */
#define BOARD_INITPINS_EMC_A4_PIN_NAME EMC_A(4)           /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A4_LABEL "U28[J3]/P1_5-EMC_A4" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A4_NAME "EMC_A4"               /*!<@brief Identifier name */
                                                          /* @} */

/*! @name EMC_A(5) (coord G4), U28[J2]/P1_6-EMC_A5
  @{ */
#define BOARD_INITPINS_EMC_A5_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A5_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A5_CHANNEL 5                   /*!<@brief EMC EMC_A channel: 5 */
#define BOARD_INITPINS_EMC_A5_PIN_NAME EMC_A(5)           /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A5_LABEL "U28[J2]/P1_6-EMC_A5" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A5_NAME "EMC_A5"               /*!<@brief Identifier name */
                                                          /* @} */

/*! @name EMC_A(6) (coord N1), U28[H3]/P1_7-EMC_A6
  @{ */
#define BOARD_INITPINS_EMC_A6_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A6_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A6_CHANNEL 6                   /*!<@brief EMC EMC_A channel: 6 */
#define BOARD_INITPINS_EMC_A6_PIN_NAME EMC_A(6)           /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A6_LABEL "U28[H3]/P1_7-EMC_A6" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A6_NAME "EMC_A6"               /*!<@brief Identifier name */
                                                          /* @} */

