chaunm/uMQTT-LPC54608/board/pin_mux.h
/*! @name EMC_A(7) (coord P8), U28[H2]/P1_8-EMC_A7
  @{ */
#define BOARD_INITPINS_EMC_A7_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A7_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A7_CHANNEL 7                   /*!<@brief EMC EMC_A channel: 7 */
#define BOARD_INITPINS_EMC_A7_PIN_NAME EMC_A(7)           /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A7_LABEL "U28[H2]/P1_8-EMC_A7" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A7_NAME "EMC_A7"               /*!<@brief Identifier name */
                                                          /* @} */

/*! @name EMC_CASN (coord K6), U28[F7]/P1_9-EMC_CASn
  @{ */
#define BOARD_INITPINS_EMC_CASn_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_CASn_SIGNAL EMC_CAS                /*!<@brief EMC signal: EMC_CAS */
#define BOARD_INITPINS_EMC_CASn_PIN_NAME EMC_CASN             /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_CASn_LABEL "U28[F7]/P1_9-EMC_CASn" /*!<@brief Label */
#define BOARD_INITPINS_EMC_CASn_NAME "EMC_CASn"               /*!<@brief Identifier name */
                                                              /* @} */

/*! @name EMC_D(8) (coord L1), U28[E1]/RP4[4]/P1_19-EMC_D8
  @{ */
#define BOARD_INITPINS_EMC_D8_PERIPHERAL EMC                      /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D8_SIGNAL EMC_D                        /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D8_CHANNEL 8                           /*!<@brief EMC EMC_D channel: 8 */
#define BOARD_INITPINS_EMC_D8_PIN_NAME EMC_D(8)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D8_LABEL "U28[E1]/RP4[4]/P1_19-EMC_D8" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D8_NAME "EMC_D8"                       /*!<@brief Identifier name */
                                                                  /* @} */

/*! @name EMC_D(9) (coord M1), U28[D2]/RP4[3]/P1_20-EMC_D9
  @{ */
#define BOARD_INITPINS_EMC_D9_PERIPHERAL EMC                      /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D9_SIGNAL EMC_D                        /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D9_CHANNEL 9                           /*!<@brief EMC EMC_D channel: 9 */
#define BOARD_INITPINS_EMC_D9_PIN_NAME EMC_D(9)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D9_LABEL "U28[D2]/RP4[3]/P1_20-EMC_D9" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D9_NAME "EMC_D9"                       /*!<@brief Identifier name */
                                                                  /* @} */

/*! @name EMC_D(10) (coord N8), U28[D1]/RP4[2]/P1_21-EMC_D10
  @{ */
#define BOARD_INITPINS_EMC_D10_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D10_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D10_CHANNEL 10                           /*!<@brief EMC EMC_D channel: 10 */
#define BOARD_INITPINS_EMC_D10_PIN_NAME EMC_D(10)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D10_LABEL "U28[D1]/RP4[2]/P1_21-EMC_D10" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D10_NAME "EMC_D10"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_RASN (coord N9), U28[F8]/P1_10-EMC_RASn
  @{ */
#define BOARD_INITPINS_EMC_RASn_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_RASn_SIGNAL EMC_RAS                 /*!<@brief EMC signal: EMC_RAS */
#define BOARD_INITPINS_EMC_RASn_PIN_NAME EMC_RASN              /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_RASn_LABEL "U28[F8]/P1_10-EMC_RASn" /*!<@brief Label */
#define BOARD_INITPINS_EMC_RASn_NAME "EMC_RASn"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name EMC_CLK(0) (coord B4), U28[F2]/P1_11-EMC_CLK0
  @{ */
#define BOARD_INITPINS_EMC_CLK0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_CLK0_SIGNAL EMC_CLK                 /*!<@brief EMC signal: EMC_CLK */
#define BOARD_INITPINS_EMC_CLK0_CHANNEL 0                      /*!<@brief EMC EMC_CLK channel: 0 */
#define BOARD_INITPINS_EMC_CLK0_PIN_NAME EMC_CLK(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_CLK0_LABEL "U28[F2]/P1_11-EMC_CLK0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_CLK0_NAME "EMC_CLK0"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name EMC_DYCSN(0) (coord K9), U28[G9]/P1_12-EMC_DYCSn0
  @{ */
#define BOARD_INITPINS_EMC_DYCSn0_PERIPHERAL EMC                   /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_DYCSn0_SIGNAL EMC_DYCS                  /*!<@brief EMC signal: EMC_DYCS */
#define BOARD_INITPINS_EMC_DYCSn0_CHANNEL 0                        /*!<@brief EMC EMC_DYCS channel: 0 */
#define BOARD_INITPINS_EMC_DYCSn0_PIN_NAME EMC_DYCSN(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_DYCSn0_LABEL "U28[G9]/P1_12-EMC_DYCSn0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_DYCSn0_NAME "EMC_DYCSn0"                /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name EMC_DQM(0) (coord G10), U28[E8]/P1_13-EMC_DQM0
  @{ */
#define BOARD_INITPINS_EMC_DQM0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_DQM0_SIGNAL EMC_DQM                 /*!<@brief EMC signal: EMC_DQM */
#define BOARD_INITPINS_EMC_DQM0_CHANNEL 0                      /*!<@brief EMC EMC_DQM channel: 0 */
#define BOARD_INITPINS_EMC_DQM0_PIN_NAME EMC_DQM(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_DQM0_LABEL "U28[E8]/P1_13-EMC_DQM0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_DQM0_NAME "EMC_DQM0"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name EMC_DQM(1) (coord C12), U28[F1]/P1_14-EMC_DQM1
  @{ */
#define BOARD_INITPINS_EMC_DQM1_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_DQM1_SIGNAL EMC_DQM                 /*!<@brief EMC signal: EMC_DQM */
#define BOARD_INITPINS_EMC_DQM1_CHANNEL 1                      /*!<@brief EMC EMC_DQM channel: 1 */
#define BOARD_INITPINS_EMC_DQM1_PIN_NAME EMC_DQM(1)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_DQM1_LABEL "U28[F1]/P1_14-EMC_DQM1" /*!<@brief Label */
#define BOARD_INITPINS_EMC_DQM1_NAME "EMC_DQM1"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name EMC_CKE(0) (coord A11), U28[F3]/P1_15-EMC_CKE0
  @{ */
#define BOARD_INITPINS_EMC_CKE0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_CKE0_SIGNAL EMC_CKE                 /*!<@brief EMC signal: EMC_CKE */
#define BOARD_INITPINS_EMC_CKE0_CHANNEL 0                      /*!<@brief EMC EMC_CKE channel: 0 */
#define BOARD_INITPINS_EMC_CKE0_PIN_NAME EMC_CKE(0)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_CKE0_LABEL "U28[F3]/P1_15-EMC_CKE0" /*!<@brief Label */
#define BOARD_INITPINS_EMC_CKE0_NAME "EMC_CKE0"                /*!<@brief Identifier name */
                                                               /* @} */

