chaunm/uMQTT-LPC54608/board/pin_mux.h
/*! @name EMC_A(10) (coord B7), U28[H9]/P1_16-EMC_A10
  @{ */
#define BOARD_INITPINS_EMC_A10_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A10_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A10_CHANNEL 10                    /*!<@brief EMC EMC_A channel: 10 */
#define BOARD_INITPINS_EMC_A10_PIN_NAME EMC_A(10)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A10_LABEL "U28[H9]/P1_16-EMC_A10" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A10_NAME "EMC_A10"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_A(11) (coord M10), U28[G2]/P1_23-EMC_A11
  @{ */
#define BOARD_INITPINS_EMC_A11_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A11_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A11_CHANNEL 11                    /*!<@brief EMC EMC_A channel: 11 */
#define BOARD_INITPINS_EMC_A11_PIN_NAME EMC_A(11)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A11_LABEL "U28[G2]/P1_23-EMC_A11" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A11_NAME "EMC_A11"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_A(12) (coord N14), U28[G1]/P1_24-EMC_A12
  @{ */
#define BOARD_INITPINS_EMC_A12_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A12_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A12_CHANNEL 12                    /*!<@brief EMC EMC_A channel: 12 */
#define BOARD_INITPINS_EMC_A12_PIN_NAME EMC_A(12)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A12_LABEL "U28[G1]/P1_24-EMC_A12" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A12_NAME "EMC_A12"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_A(13) (coord M12), U28[G7]/P1_25-EMC_A13
  @{ */
#define BOARD_INITPINS_EMC_A13_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A13_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A13_CHANNEL 13                    /*!<@brief EMC EMC_A channel: 13 */
#define BOARD_INITPINS_EMC_A13_PIN_NAME EMC_A(13)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A13_LABEL "U28[G7]/P1_25-EMC_A13" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A13_NAME "EMC_A13"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_D(12) (coord E12), U28[C1]/RP2[4]/P1_28-EMC_D12
  @{ */
#define BOARD_INITPINS_EMC_D12_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D12_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D12_CHANNEL 12                           /*!<@brief EMC EMC_D channel: 12 */
#define BOARD_INITPINS_EMC_D12_PIN_NAME EMC_D(12)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D12_LABEL "U28[C1]/RP2[4]/P1_28-EMC_D12" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D12_NAME "EMC_D12"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_D(13) (coord C11), U28[B2]/RP2[3]/P1_29-EMC_D13
  @{ */
#define BOARD_INITPINS_EMC_D13_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D13_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D13_CHANNEL 13                           /*!<@brief EMC EMC_D channel: 13 */
#define BOARD_INITPINS_EMC_D13_PIN_NAME EMC_D(13)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D13_LABEL "U28[B2]/RP2[3]/P1_29-EMC_D13" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D13_NAME "EMC_D13"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_D(14) (coord A8), U28[B1]/RP2[2]/P1_30-EMC_D14
  @{ */
#define BOARD_INITPINS_EMC_D14_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D14_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D14_CHANNEL 14                           /*!<@brief EMC EMC_D channel: 14 */
#define BOARD_INITPINS_EMC_D14_PIN_NAME EMC_D(14)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D14_LABEL "U28[B1]/RP2[2]/P1_30-EMC_D14" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D14_NAME "EMC_D14"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_D(15) (coord C5), U28[A2]/RP2[1]/P1_31-EMC_D15
  @{ */
#define BOARD_INITPINS_EMC_D15_PERIPHERAL EMC                       /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_D15_SIGNAL EMC_D                         /*!<@brief EMC signal: EMC_D */
#define BOARD_INITPINS_EMC_D15_CHANNEL 15                           /*!<@brief EMC EMC_D channel: 15 */
#define BOARD_INITPINS_EMC_D15_PIN_NAME EMC_D(15)                   /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_D15_LABEL "U28[A2]/RP2[1]/P1_31-EMC_D15" /*!<@brief Label */
#define BOARD_INITPINS_EMC_D15_NAME "EMC_D15"                       /*!<@brief Identifier name */
                                                                    /* @} */

/*! @name EMC_A(8) (coord J10), U28[H1]/P1_26-EMC_A8
  @{ */
#define BOARD_INITPINS_EMC_A8_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A8_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A8_CHANNEL 8                    /*!<@brief EMC EMC_A channel: 8 */
#define BOARD_INITPINS_EMC_A8_PIN_NAME EMC_A(8)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A8_LABEL "U28[H1]/P1_26-EMC_A8" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A8_NAME "EMC_A8"                /*!<@brief Identifier name */
                                                           /* @} */

