chaunm/uMQTT-LPC54608/board/pin_mux.h
/*! @name EMC_A(9) (coord F10), U28[G3]/P1_27-EMC_A9
  @{ */
#define BOARD_INITPINS_EMC_A9_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A9_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A9_CHANNEL 9                    /*!<@brief EMC EMC_A channel: 9 */
#define BOARD_INITPINS_EMC_A9_PIN_NAME EMC_A(9)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A9_LABEL "U28[G3]/P1_27-EMC_A9" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A9_NAME "EMC_A9"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name EMC_A(14) (coord P9), U28[G8]/P3_25-EMC_A14
  @{ */
#define BOARD_INITPINS_EMC_A14_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_INITPINS_EMC_A14_SIGNAL EMC_A                  /*!<@brief EMC signal: EMC_A */
#define BOARD_INITPINS_EMC_A14_CHANNEL 14                    /*!<@brief EMC EMC_A channel: 14 */
#define BOARD_INITPINS_EMC_A14_PIN_NAME EMC_A(14)            /*!<@brief Pin name */
#define BOARD_INITPINS_EMC_A14_LABEL "U28[G8]/P3_25-EMC_A14" /*!<@brief Label */
#define BOARD_INITPINS_EMC_A14_NAME "EMC_A14"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name LCD_PWR (coord K3), J16[31]/P2_11-LCD_PWR
  @{ */
#define BOARD_INITPINS_LCD_PWR_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_PWR_SIGNAL LCD_PWR                /*!<@brief LCD signal: LCD_PWR */
#define BOARD_INITPINS_LCD_PWR_PIN_NAME LCD_PWR              /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_PWR_LABEL "J16[31]/P2_11-LCD_PWR" /*!<@brief Label */
#define BOARD_INITPINS_LCD_PWR_NAME "LCD_PWR"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name LCD_DCLK (coord P7), J16[30]/P2_13-LCD_DCLK
  @{ */
#define BOARD_INITPINS_LCD_DCLK_PERIPHERAL LCD                 /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_DCLK_SIGNAL LCD_DCLK                /*!<@brief LCD signal: LCD_DCLK */
#define BOARD_INITPINS_LCD_DCLK_PIN_NAME LCD_DCLK              /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_DCLK_LABEL "J16[30]/P2_13-LCD_DCLK" /*!<@brief Label */
#define BOARD_INITPINS_LCD_DCLK_NAME "LCD_DCLK"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name LCD_FP (coord L7), J16[33]/P2_14-LCD_FP
  @{ */
#define BOARD_INITPINS_LCD_FP_PERIPHERAL LCD               /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_FP_SIGNAL LCD_FP                /*!<@brief LCD signal: LCD_FP */
#define BOARD_INITPINS_LCD_FP_PIN_NAME LCD_FP              /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_FP_LABEL "J16[33]/P2_14-LCD_FP" /*!<@brief Label */
#define BOARD_INITPINS_LCD_FP_NAME "LCD_FP"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name LCD_AC (coord M8), J16[34]/P2_15-LCD_AC_ENAB_M
  @{ */
/*!
 * @brief Device name: LCD */
#define BOARD_INITPINS_LCD_AC_ENAB_M_PERIPHERAL LCD
/*!
 * @brief LCD signal: LCD_AC */
#define BOARD_INITPINS_LCD_AC_ENAB_M_SIGNAL LCD_AC
/*!
 * @brief Pin name */
#define BOARD_INITPINS_LCD_AC_ENAB_M_PIN_NAME LCD_AC
/*!
 * @brief Label */
#define BOARD_INITPINS_LCD_AC_ENAB_M_LABEL "J16[34]/P2_15-LCD_AC_ENAB_M"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_LCD_AC_ENAB_M_NAME "LCD_AC_ENAB_M"
/* @} */

/*! @name LCD_LP (coord L8), J16[32]/P2_16-LCD_LP
  @{ */
#define BOARD_INITPINS_LCD_LP_PERIPHERAL LCD               /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_LP_SIGNAL LCD_LP                /*!<@brief LCD signal: LCD_LP */
#define BOARD_INITPINS_LCD_LP_PIN_NAME LCD_LP              /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_LP_LABEL "J16[32]/P2_16-LCD_LP" /*!<@brief Label */
#define BOARD_INITPINS_LCD_LP_NAME "LCD_LP"                /*!<@brief Identifier name */
                                                           /* @} */

/*! @name LCD_VD(3) (coord L10), J16[8]/P2_21-LCD_VD3
  @{ */
#define BOARD_INITPINS_LCD_VD3_PERIPHERAL LCD               /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD3_SIGNAL LCD_VD                /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD3_CHANNEL 3                    /*!<@brief LCD LCD_VD channel: 3 */
#define BOARD_INITPINS_LCD_VD3_PIN_NAME LCD_VD(3)           /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD3_LABEL "J16[8]/P2_21-LCD_VD3" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD3_NAME "LCD_VD3"               /*!<@brief Identifier name */
                                                            /* @} */

/*! @name LCD_VD(4) (coord K10), J16[9]/P2_22-LCD_VD4
  @{ */
#define BOARD_INITPINS_LCD_VD4_PERIPHERAL LCD               /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD4_SIGNAL LCD_VD                /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD4_CHANNEL 4                    /*!<@brief LCD LCD_VD channel: 4 */
#define BOARD_INITPINS_LCD_VD4_PIN_NAME LCD_VD(4)           /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD4_LABEL "J16[9]/P2_22-LCD_VD4" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD4_NAME "LCD_VD4"               /*!<@brief Identifier name */
                                                            /* @} */

/*! @name LCD_VD(5) (coord M14), J16[10]/P2_23-LCD_VD5
  @{ */
#define BOARD_INITPINS_LCD_VD5_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD5_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD5_CHANNEL 5                     /*!<@brief LCD LCD_VD channel: 5 */
#define BOARD_INITPINS_LCD_VD5_PIN_NAME LCD_VD(5)            /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD5_LABEL "J16[10]/P2_23-LCD_VD5" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD5_NAME "LCD_VD5"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name LCD_VD(6) (coord K14), J16[11]/P2_24-LCD_VD6
  @{ */
#define BOARD_INITPINS_LCD_VD6_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD6_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD6_CHANNEL 6                     /*!<@brief LCD LCD_VD channel: 6 */
#define BOARD_INITPINS_LCD_VD6_PIN_NAME LCD_VD(6)            /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD6_LABEL "J16[11]/P2_24-LCD_VD6" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD6_NAME "LCD_VD6"                /*!<@brief Identifier name */
                                                             /* @} */

/*! @name LCD_VD(7) (coord J11), J16[12]/P2_25-LCD_VD7
  @{ */
#define BOARD_INITPINS_LCD_VD7_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD7_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD7_CHANNEL 7                     /*!<@brief LCD LCD_VD channel: 7 */
#define BOARD_INITPINS_LCD_VD7_PIN_NAME LCD_VD(7)            /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD7_LABEL "J16[12]/P2_25-LCD_VD7" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD7_NAME "LCD_VD7"                /*!<@brief Identifier name */
                                                             /* @} */

