chaunm/uMQTT-LPC54608/board/pin_mux.h
/*! @name LCD_VD(10) (coord G13), J16[15]/P2_28-LCD_VD10
  @{ */
#define BOARD_INITPINS_LCD_VD10_PERIPHERAL LCD                 /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD10_SIGNAL LCD_VD                  /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD10_CHANNEL 10                     /*!<@brief LCD LCD_VD channel: 10 */
#define BOARD_INITPINS_LCD_VD10_PIN_NAME LCD_VD(10)            /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD10_LABEL "J16[15]/P2_28-LCD_VD10" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD10_NAME "LCD_VD10"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name LCD_VD(11) (coord G11), J16[16]/P2_29-LCD_VD11
  @{ */
#define BOARD_INITPINS_LCD_VD11_PERIPHERAL LCD                 /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD11_SIGNAL LCD_VD                  /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD11_CHANNEL 11                     /*!<@brief LCD LCD_VD channel: 11 */
#define BOARD_INITPINS_LCD_VD11_PIN_NAME LCD_VD(11)            /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD11_LABEL "J16[16]/P2_29-LCD_VD11" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD11_NAME "LCD_VD11"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name LCD_VD(12) (coord F12), J16[17]/P2_30-LCD_VD12
  @{ */
#define BOARD_INITPINS_LCD_VD12_PERIPHERAL LCD                 /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD12_SIGNAL LCD_VD                  /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD12_CHANNEL 12                     /*!<@brief LCD LCD_VD channel: 12 */
#define BOARD_INITPINS_LCD_VD12_PIN_NAME LCD_VD(12)            /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD12_LABEL "J16[17]/P2_30-LCD_VD12" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD12_NAME "LCD_VD12"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name LCD_VD(13) (coord D14), J16[18]/P2_31-LCD_VD13
  @{ */
#define BOARD_INITPINS_LCD_VD13_PERIPHERAL LCD                 /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD13_SIGNAL LCD_VD                  /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD13_CHANNEL 13                     /*!<@brief LCD LCD_VD channel: 13 */
#define BOARD_INITPINS_LCD_VD13_PIN_NAME LCD_VD(13)            /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD13_LABEL "J16[18]/P2_31-LCD_VD13" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD13_NAME "LCD_VD13"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name LCD_VD(14) (coord D12), J16[19]/JS36[1]/P3_0-LCD_VD14
  @{ */
#define BOARD_INITPINS_LCD_VD14_PERIPHERAL LCD                        /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD14_SIGNAL LCD_VD                         /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD14_CHANNEL 14                            /*!<@brief LCD LCD_VD channel: 14 */
#define BOARD_INITPINS_LCD_VD14_PIN_NAME LCD_VD(14)                   /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD14_LABEL "J16[19]/JS36[1]/P3_0-LCD_VD14" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD14_NAME "LCD_VD14"                       /*!<@brief Identifier name */
                                                                      /* @} */

/*! @name LCD_VD(15) (coord D11), J16[20]/JS33[1]/P3_1-LCD_VD15
  @{ */
#define BOARD_INITPINS_LCD_VD15_PERIPHERAL LCD                        /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD15_SIGNAL LCD_VD                         /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD15_CHANNEL 15                            /*!<@brief LCD LCD_VD channel: 15 */
#define BOARD_INITPINS_LCD_VD15_PIN_NAME LCD_VD(15)                   /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD15_LABEL "J16[20]/JS33[1]/P3_1-LCD_VD15" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD15_NAME "LCD_VD15"                       /*!<@brief Identifier name */
                                                                      /* @} */

/*! @name LCD_VD(19) (coord B10), J16[24]/P3_5-LCD_VD19
  @{ */
#define BOARD_INITPINS_LCD_VD19_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD19_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD19_CHANNEL 19                    /*!<@brief LCD LCD_VD channel: 19 */
#define BOARD_INITPINS_LCD_VD19_PIN_NAME LCD_VD(19)           /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD19_LABEL "J16[24]/P3_5-LCD_VD19" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD19_NAME "LCD_VD19"               /*!<@brief Identifier name */
                                                              /* @} */

/*! @name LCD_VD(20) (coord C9), J16[25]/P3_6-LCD_VD20
  @{ */
#define BOARD_INITPINS_LCD_VD20_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD20_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD20_CHANNEL 20                    /*!<@brief LCD LCD_VD channel: 20 */
#define BOARD_INITPINS_LCD_VD20_PIN_NAME LCD_VD(20)           /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD20_LABEL "J16[25]/P3_6-LCD_VD20" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD20_NAME "LCD_VD20"               /*!<@brief Identifier name */
                                                              /* @} */

/*! @name LCD_VD(21) (coord B8), J16[26]/P3_7-LCD_VD21
  @{ */
#define BOARD_INITPINS_LCD_VD21_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD21_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD21_CHANNEL 21                    /*!<@brief LCD LCD_VD channel: 21 */
#define BOARD_INITPINS_LCD_VD21_PIN_NAME LCD_VD(21)           /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD21_LABEL "J16[26]/P3_7-LCD_VD21" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD21_NAME "LCD_VD21"               /*!<@brief Identifier name */
                                                              /* @} */

