chaunm/uMQTT-LPC54608/board/pin_mux.h
/*! @name LCD_VD(22) (coord A7), J16[27]/P3_8-LCD_VD22
  @{ */
#define BOARD_INITPINS_LCD_VD22_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD22_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD22_CHANNEL 22                    /*!<@brief LCD LCD_VD channel: 22 */
#define BOARD_INITPINS_LCD_VD22_PIN_NAME LCD_VD(22)           /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD22_LABEL "J16[27]/P3_8-LCD_VD22" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD22_NAME "LCD_VD22"               /*!<@brief Identifier name */
                                                              /* @} */

/*! @name LCD_VD(23) (coord C7), J16[28]/P3_9-LCD_VD23
  @{ */
#define BOARD_INITPINS_LCD_VD23_PERIPHERAL LCD                /*!<@brief Device name: LCD */
#define BOARD_INITPINS_LCD_VD23_SIGNAL LCD_VD                 /*!<@brief LCD signal: LCD_VD */
#define BOARD_INITPINS_LCD_VD23_CHANNEL 23                    /*!<@brief LCD LCD_VD channel: 23 */
#define BOARD_INITPINS_LCD_VD23_PIN_NAME LCD_VD(23)           /*!<@brief Pin name */
#define BOARD_INITPINS_LCD_VD23_LABEL "J16[28]/P3_9-LCD_VD23" /*!<@brief Label */
#define BOARD_INITPINS_LCD_VD23_NAME "LCD_VD23"               /*!<@brief Identifier name */
                                                              /* @} */

/*! @name FC2_CTS_SDA_SSEL0 (coord C2), J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX
  @{ */
/*!
 * @brief Device name: FLEXCOMM2 */
#define BOARD_INITPINS_FC2_SDAX_PERIPHERAL FLEXCOMM2
/*!
 * @brief FLEXCOMM2 signal: CTS_SDA_SSEL0 */
#define BOARD_INITPINS_FC2_SDAX_SIGNAL CTS_SDA_SSEL0
/*!
 * @brief Pin name */
#define BOARD_INITPINS_FC2_SDAX_PIN_NAME FC2_CTS_SDA_SSEL0
/*!
 * @brief Label */
#define BOARD_INITPINS_FC2_SDAX_LABEL "J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_FC2_SDAX_NAME "FC2_SDAX"
/* @} */

/*! @name FC2_RTS_SCL_SSEL1 (coord E2), J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX
  @{ */
/*!
 * @brief Device name: FLEXCOMM2 */
#define BOARD_INITPINS_FC2_SCLX_PERIPHERAL FLEXCOMM2
/*!
 * @brief FLEXCOMM2 signal: RTS_SCL_SSEL1 */
#define BOARD_INITPINS_FC2_SCLX_SIGNAL RTS_SCL_SSEL1
/*!
 * @brief Pin name */
#define BOARD_INITPINS_FC2_SCLX_PIN_NAME FC2_RTS_SCL_SSEL1
/*!
 * @brief Label */
#define BOARD_INITPINS_FC2_SCLX_LABEL "J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_FC2_SCLX_NAME "FC2_SCLX"
/* @} */

/*! @name ENET_TXD0 (coord B14), U12[17]/JP11[1]/P4_8-ENET_TXD0
  @{ */
/*!
 * @brief Device name: ENET */
#define BOARD_INITPINS_ENET_TXD0_PERIPHERAL ENET
/*!
 * @brief ENET signal: ENET_TXD */
#define BOARD_INITPINS_ENET_TXD0_SIGNAL ENET_TXD
/*!
 * @brief ENET ENET_TXD channel: 0 */
#define BOARD_INITPINS_ENET_TXD0_CHANNEL 0
/*!
 * @brief Pin name */
#define BOARD_INITPINS_ENET_TXD0_PIN_NAME ENET_TXD0
/*!
 * @brief Label */
#define BOARD_INITPINS_ENET_TXD0_LABEL "U12[17]/JP11[1]/P4_8-ENET_TXD0"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_ENET_TXD0_NAME "ENET_TXD0"
/* @} */

/*! @name ENET_RX_DV (coord B9), U12[11]/P4_10-ENET_CRS_DV
  @{ */
#define BOARD_INITPINS_ENET_CRS_DV_PERIPHERAL ENET                   /*!<@brief Device name: ENET */
#define BOARD_INITPINS_ENET_CRS_DV_SIGNAL ENET_RX_DV                 /*!<@brief ENET signal: ENET_RX_DV */
#define BOARD_INITPINS_ENET_CRS_DV_PIN_NAME ENET_RX_DV               /*!<@brief Pin name */
#define BOARD_INITPINS_ENET_CRS_DV_LABEL "U12[11]/P4_10-ENET_CRS_DV" /*!<@brief Label */
#define BOARD_INITPINS_ENET_CRS_DV_NAME "ENET_CRS_DV"                /*!<@brief Identifier name */
                                                                     /* @} */

/*! @name ENET_RXD1 (coord A6), U12[7]/P4_12-ENET_RXD1
  @{ */
#define BOARD_INITPINS_ENET_RXD1_PERIPHERAL ENET                /*!<@brief Device name: ENET */
#define BOARD_INITPINS_ENET_RXD1_SIGNAL ENET_RXD                /*!<@brief ENET signal: ENET_RXD */
#define BOARD_INITPINS_ENET_RXD1_CHANNEL 1                      /*!<@brief ENET ENET_RXD channel: 1 */
#define BOARD_INITPINS_ENET_RXD1_PIN_NAME ENET_RXD1             /*!<@brief Pin name */
#define BOARD_INITPINS_ENET_RXD1_LABEL "U12[7]/P4_12-ENET_RXD1" /*!<@brief Label */
#define BOARD_INITPINS_ENET_RXD1_NAME "ENET_RXD1"               /*!<@brief Identifier name */
                                                                /* @} */

/*! @name ENET_TX_EN (coord B6), U12[16]/P4_13-ENET_TX_EN
  @{ */
#define BOARD_INITPINS_ENET_TX_EN_PERIPHERAL ENET                  /*!<@brief Device name: ENET */
#define BOARD_INITPINS_ENET_TX_EN_SIGNAL ENET_TX_EN                /*!<@brief ENET signal: ENET_TX_EN */
#define BOARD_INITPINS_ENET_TX_EN_PIN_NAME ENET_TX_EN              /*!<@brief Pin name */
#define BOARD_INITPINS_ENET_TX_EN_LABEL "U12[16]/P4_13-ENET_TX_EN" /*!<@brief Label */
#define BOARD_INITPINS_ENET_TX_EN_NAME "ENET_TX_EN"                /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name ENET_RX_CLK (coord B5), JS18[2]/P4_14-ENET_RX_CLK
  @{ */
#define BOARD_INITPINS_ENET_RX_CLK_PERIPHERAL ENET                   /*!<@brief Device name: ENET */
#define BOARD_INITPINS_ENET_RX_CLK_SIGNAL ENET_RX_CLK                /*!<@brief ENET signal: ENET_RX_CLK */
#define BOARD_INITPINS_ENET_RX_CLK_PIN_NAME ENET_RX_CLK              /*!<@brief Pin name */
#define BOARD_INITPINS_ENET_RX_CLK_LABEL "JS18[2]/P4_14-ENET_RX_CLK" /*!<@brief Label */
#define BOARD_INITPINS_ENET_RX_CLK_NAME "ENET_RX_CLK"                /*!<@brief Identifier name */
                                                                     /* @} */

/*! @name ENET_MDC (coord A4), U12[13]/P4_15-ENET_MDC
  @{ */
#define BOARD_INITPINS_ENET_MDC_PERIPHERAL ENET                /*!<@brief Device name: ENET */
#define BOARD_INITPINS_ENET_MDC_SIGNAL ENET_MDC                /*!<@brief ENET signal: ENET_MDC */
#define BOARD_INITPINS_ENET_MDC_PIN_NAME ENET_MDC              /*!<@brief Pin name */
#define BOARD_INITPINS_ENET_MDC_LABEL "U12[13]/P4_15-ENET_MDC" /*!<@brief Label */
#define BOARD_INITPINS_ENET_MDC_NAME "ENET_MDC"                /*!<@brief Identifier name */
                                                               /* @} */

/*! @name ENET_MDIO (coord C4), U12[12]/P4_16-ENET_MDIO
  @{ */
#define BOARD_INITPINS_ENET_MDIO_PERIPHERAL ENET                 /*!<@brief Device name: ENET */
#define BOARD_INITPINS_ENET_MDIO_SIGNAL ENET_MDIO                /*!<@brief ENET signal: ENET_MDIO */
#define BOARD_INITPINS_ENET_MDIO_PIN_NAME ENET_MDIO              /*!<@brief Pin name */
#define BOARD_INITPINS_ENET_MDIO_LABEL "U12[12]/P4_16-ENET_MDIO" /*!<@brief Label */
#define BOARD_INITPINS_ENET_MDIO_NAME "ENET_MDIO"                /*!<@brief Identifier name */
                                                                 /* @} */

