chaunm/uMQTT-LPC54608/board/pin_mux.h
/*! @name ENET_TXD1 (coord E14), U12[18]/P0_17-ENET_TXD1
  @{ */
#define BOARD_INITPINS_ENET_TXD1_PERIPHERAL ENET                 /*!<@brief Device name: ENET */
#define BOARD_INITPINS_ENET_TXD1_SIGNAL ENET_TXD                 /*!<@brief ENET signal: ENET_TXD */
#define BOARD_INITPINS_ENET_TXD1_CHANNEL 1                       /*!<@brief ENET ENET_TXD channel: 1 */
#define BOARD_INITPINS_ENET_TXD1_PIN_NAME ENET_TXD1              /*!<@brief Pin name */
#define BOARD_INITPINS_ENET_TXD1_LABEL "U12[18]/P0_17-ENET_TXD1" /*!<@brief Label */
#define BOARD_INITPINS_ENET_TXD1_NAME "ENET_TXD1"                /*!<@brief Identifier name */
                                                                 /* @} */

/*! @name PIO2_26 (coord H11), U12[15]/P2_26-ENET_PHY_RSTn
  @{ */
/*!
 * @brief Device name: GPIO */
#define BOARD_INITPINS_ENET_PHY_RSTn_PERIPHERAL GPIO
/*!
 * @brief GPIO signal: PIO2 */
#define BOARD_INITPINS_ENET_PHY_RSTn_SIGNAL PIO2
/*!
 * @brief GPIO device name: GPIO */
#define BOARD_INITPINS_ENET_PHY_RSTn_GPIO GPIO
/*!
 * @brief PIO2 pin index: 26 */
#define BOARD_INITPINS_ENET_PHY_RSTn_GPIO_PIN 26U
/*!
 * @brief PORT device name: 2U */
#define BOARD_INITPINS_ENET_PHY_RSTn_PORT 2U
/*!
 * @brief 2U pin index: 26 */
#define BOARD_INITPINS_ENET_PHY_RSTn_PIN 26U
/*!
 * @brief GPIO PIO2 channel: 26 */
#define BOARD_INITPINS_ENET_PHY_RSTn_CHANNEL 26
/*!
 * @brief Pin name */
#define BOARD_INITPINS_ENET_PHY_RSTn_PIN_NAME PIO2_26
/*!
 * @brief Label */
#define BOARD_INITPINS_ENET_PHY_RSTn_LABEL "U12[15]/P2_26-ENET_PHY_RSTn"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_ENET_PHY_RSTn_NAME "ENET_PHY_RSTn"
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
